<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
    <head>
        <title>Ошибка в данных</title>
    </head>
    <body>
        <h1>Неподдерживаемые данные</h1>
        <h2>Причины</h2>
        <ul>
            <li>Некорректное значение</li>
            <li>Размер данных превышает дозволенный</li>
            <li>Неподдреживаемый тип файла</li>
            <li>Размер файла слишком высок</li>
            <li>Размер файла слишком мал</li>
        </ul>
        <p>Повторите попытку с другими данными или свяжитесь с разработчиком</p>
    </body>
</html>
